Repository: WitnessAngel/witness-angel-components
Catalog: src/wacomponents/locale/*/LC_MESSAGES/witnessangel.po
Languages: fr

source: Empty
fr: Vide

source: Some configuration changes might only apply at next recording restart
fr: Certains changements de configuration pourraient ne s'appliquer qu'au redémarrage de l'enregistrement

source: Configuration errors prevent recording
fr: Des erreurs de configuration empêchent l'enregistrement

source: Container storage: {cryptainer_dir}
fr: Stockage des conteneurs : {cryptainer_dir}

source: Invalid container storage: "{cryptainer_dir}"
fr: Stockage des conteneurs invalide : {cryptainer_dir}

source: {keyguardian_count} key guardian(s) selected, {keyguardian_threshold} of which necessary for decryption
fr: {keyguardian_count} gardien(s) de clés configuré(s), dont {keyguardian_threshold} nécessaire(s) pour le déchiffrement

source: IP camera url: {camera_url}
fr: Url de la caméra IP : {camera_url}

source: Wrong IP camera url: "{camera_url}"
fr: Mauvaise url de caméra IP : "{camera_url}"

source: Gateway url: {wagateway_url}
fr: Url de la passerelle : {wagateway_url}

source: Wrong gateway url: '{wagateway_url}'
fr: Mauvaise url de passerelle : '{wagateway_url}'

source: Each container stores {recording_duration_mn} mn(s) of video
fr: Chaque conteneur stocke {recording_duration_mn} mn(s) de vidéo

source: Containers are kept for {max_cryptainer_age_day} day(s)
fr: Les conteneurs sont gardés {max_cryptainer_age_day} jour(s)

source: Ffmpeg module is installed with a compatible {ffmpeg_version:.1f} version
fr: Module ffmpeg installé avec une version {ffmpeg_version:.1f} compatible

source: Ffmpeg module is installed but this {ffmpeg_version:.1f} version is below required {min_ffmpeg_version}
fr: Module ffmpeg installé mais sa version {ffmpeg_version:.1f} est inférieure à {min_ffmpeg_version} requise

source: Create Authenticator
fr: Créer un Authentifieur

source: Back
fr: Retour

source: Help
fr: Aide

source: Authenticator: %s
fr: Authentifieur : %s

source: User name
fr: Utilisateur

source: Passphrase
fr: Phrase secrète

source: Passphrase hint
fr: Indice de phrase secrète

source: Initialize
fr: Initialiser

source: Please enter a username, passphrase and passphrase hint.
fr: Veuillez entrer un nom d'utilisateur, une phrase secrète et son indice.

source: Username, passphrase and passphrase hint must not exceed %s characters
fr: Le nom d'utilisateur, la phrase secrète et son indice ne doivent pas dépasser %s caractères.

source: Passphrase must be at least %s characters long.
fr: La phrase secrète doit faire au moins %s caractères de long.

source: Validation error
fr: Erreur de validation

source: Please wait, generation of cryptographic keys might take a few minutes.
fr: Veuillez attendre, la génération des clés cryptographiques peut prendre quelques minutes.

source: Initialization successfully completed.
fr: Initialisation complétée avec succès.

source: Success
fr: Succès

source: Operation failed, check logs.
fr: Opération échouée, vérifiez les logs.

source: Failure
fr: Échec

source: On this page, you can initialize an authenticator inside an empty folder; this authenticator actually consists in metadata files as well as a set of asymmetric keypairs.
fr: Sur cette page, vous pouvez initialiser un authentifieur dans un dossier vide ; cet authentifieur consiste en réalité en des fichiers de métadonnées, ainsi qu'en un ensemble de paires de clés asymétriques.

source: To proceed, you have to input your user name or pseudo, a long passphrase (e.g. consisting of 4 different words), and a public hint to help your remember your passphrase later.
fr: Pour procéder, vous devez entrer votre nom d'utilisateur ou pseudo, une longue phrase secrète (par exemple, composée de 4 mots différents), et un indice public pour vous aider à vous souvenir de votre phrase secrète plus tard.

source: You should keep your passphrase somewhere safe (in a digital password manager, on a paper in a vault...), because if you forget any of its aspects (upper/lower case, accents, spaces...), there is no way to recover it.
fr: Vous devez conserver votre phrase secrète en lieu sûr (dans un gestionnaire de mots de passe numérique, sur un papier dans un coffre-fort...), car si vous oubliez l'un de ses aspects (majuscules/minuscules, accents, espaces...), il n'y a aucun moyen de la récupérer.

source: Authenticator creation page
fr: Page de création d'authentifieur

source: User profile
fr: Profil utilisateur

source: Stored inside system disk
fr: Stocké dans le disque système

source: Custom location
fr: Emplacement personnalisé

source: Please select a folder
fr: Veuillez sélectionner un dossier

source: Authenticators
fr: Authentifieurs

source: Refresh
fr: Rafraîchir

source: Language
fr: Langue

source: Settings
fr: Paramètres

source: Please select an authenticator location
fr: Veuillez sélectionner un emplacement d'authentifieur

source: No information available
fr: Aucune information disponible

source: Import
fr: Importer

source: Export
fr: Exporter

source: Check
fr: Vérifier

source: Destroy
fr: Détruire

source: Publish
fr: Publier

source: Authorizations
fr: Autorisations

source: Drive {drive} ({label})
fr: Disque {drive} ({label})

source: no name
fr: sans nom

source: Size: {size}, Filesystem: {filesystem}
fr: Taille : {size}, Format : {filesystem}

source: Refreshed authenticator locations
fr: Emplacements d'authentifieurs rafraichis

source: External storage is not accessible
fr: Stockage externe non accessible

source: No valid location selected
fr: Aucun emplacement valide sélectionné

source: Authenticator not initialized
fr: Authentifieur non initialisé

source: Authenticator initialized
fr: Authentifieur initialisé

source: Please select an authenticator folder
fr: Veuillez sélectionner un dossier d'authentifieur

source: Path: %s
fr: Chemin : %s

source: Selected folder is invalid!
fr: Le dossier sélectionné est invalide !

source: Beware, parent folder is NOT writable!
fr: Attention, le dossier parent n'est PAS accessible en écriture !

source: Beware, this is not a folder!
fr: Attention, ce n'est pas un dossier !

source: Beware, this folder is NOT writable!
fr: Attention, ce dossier n'est PAS accessible en écriture !

source: Invalid authenticator data in %s
fr: Données d'authentifieur invalides dans %s

source: Path
fr: Chemin

source: User
fr: Utilisateur

source: Password hint
fr: Indice de phrase secrète

source: Creation date
fr: Date de création

source: Keypairs
fr: Paires de clés

source: Import successful
fr: Importation réussie

source: Authenticator archive unpacked from %s, its integrity has not been checked though.
fr: L'archive d'authentifieur a été décompressée depuis %s, son intégrité n'a cependant pas été vérifiée.

source: Cancel
fr: Annuler

source: Export authenticator
fr: Exporter l'authentifieur

source: The exported archive should be kept in a secure place.
fr: L'archive exportée doit être gardée en lieu sûr.

source: Confirm
fr: Confirmer

source: Export successful
fr: Exportation réussie

source: Authenticator archive exported to %s
fr: L'archive de l'authentifieur a été exportée vers %s

source: Destroy authenticator
fr: Détruire l'authentifieur

source: Beware, this might make encrypted data using these keys impossible to decrypt.
fr: Attention, cela peut rendre impossible le déchiffrement des données chiffrées utilisant ces clés.

source: Deletion is over
fr: Destruction terminée

source: Folder %s has been properly removed.
fr: Le dossier %s a été correctement supprimé.

source: Test integrity and passphrase of authenticator
fr: Tester l'intégrité et la phrase secrète de l'authentifieur

source: Sanity check
fr: Contrôle d'intégrité

source: Keypairs successfully tested: %s
fr: Paires de clés testées avec succès : %s

source: Keypairs tested: {keypair_count} Missing private keys: {missing_private_keys} Wrong passphrase for keys: {undecodable_private_keys}
fr: Paires de clés testées : {keypair_count} Clés privées manquantes : {missing_private_keys} Mauvaise phrase secrète pour les clés : {undecodable_private_keys}

source: Checkup result: %s
fr: Résultat du contrôle : %s

source: On this page, you can manage your authenticators, which are actually digital keychains identified by unique IDs.
fr: Sur cette page, vous pouvez gérer vos authentifieurs, qui sont en fait des trousseaux de clés numériques identifiés par des ID uniques.

source: These keychains contain both public keys, which can be freely shared, and their corresponding private keys, protected by passphrases, which must be kept hidden.
fr: Ces trousseaux contiennent à la fois des clés publiques, qui peuvent être partagées librement, et les clés privées correspondantes, protégées par des phrases secrètes, qui doivent rester cachées.

source: Authenticators can be stored in your user profile or in a custom folder, especially at the root of removable devices.
fr: Les authentifieurs peuvent être stockés dans votre profil utilisateur ou dans un dossier personnalisé, notamment à la racine des périphériques amovibles.

source: You can initialize new authenticators from scratch, import/export them from/to ZIP archives, or check their integrity by providing their passphrases.
fr: Vous pouvez initialiser de nouveaux authentifieurs à partir de zéro, les importer/exporter depuis/vers des archives ZIP, ou vérifier leur intégrité en fournissant leurs phrases secrètes.

source: Note that if you destroy an authenticator, or lose its passphrase, the WitnessAngel recordings which used it as a trusted third party might not be decryptable anymore.
fr: Notez que si vous détruisez un authentifieur, ou perdez sa phrase secrète, les enregistrements WitnessAngel qui l'utilisaient en tant que tiers de confiance risquent de ne plus pouvoir être déchiffrés.

source: Authenticator management page
fr: Page de gestion des authentifieurs

source: Publish authenticator
fr: Publier l'authentifieur

source: Error querying gateway server, please check its url and you connectivity
fr: Erreur lors de l'appel au serveur gateway, veuillez vérifier son url et votre connectivité

source: NOT PUBLISHED
fr: NON PUBLIÉ

source: The local authenticator does not exist in the remote repository.
fr: L'authentifieur local n'existe pas dans le dépôt distant.

source: PUBLISHED
fr: PUBLIÉ

source: The remote authenticator is up to date.
fr: L'authentifieur distant est à jour.

source: An inconsistency has been detected between the local and remote authenticator.
fr: Une incohérence a été détectée entre l'authentifieur local et distant

source: Error details
fr: Détails d'erreurs

source: Exceeding key(s) in remote
fr: Clés en excès côté distant

source: Missing key(s) in remote
fr: Clés manquantes côté distant

source: Authenticator path
fr: Chemin d'authentifieur

source: Gateway
fr: Passerelle

source: Remote status
fr: Statut distant

source: Provide the Authenticator ID to users wanting to rely on you as a Key Guardian
fr: Fournissez l'ID d'Authentifieur aux utilisateurs désirant vous ajouter comme Gardien de Clés

source: Remote authenticator status has been updated
fr: Le statut de l'authentifieur distant a été actualisé

source: This page allows to publish the PUBLIC part of an authenticator to a remote Witness Angel Gateway, so that other users may import it to secure their recordings.
fr: Cette page permet de publier la partie PUBLIC d'un authentifiant sur une passerelle Witness Angel distante, afin que d'autres utilisateurs puissent l'importer pour sécuriser leurs enregistrements.

source: For now, a published authenticator can't be modified or deleted.
fr: Pour l'instant, un authentifiant publié ne peut pas être modifié ou supprimé.

source: In case of incoherences between the keys locally and remotely stored, these errors are displayed here.
fr: En cas d'incohérences entre les clés stockées localement et à distance, ces erreurs sont affichées ici.

source: Authenticator publishing
fr: Publication de l'authentifieur

source: Authorization request details
fr: Détails des demandes d'autorisation

source: Accept
fr: Accepter

source: Reject
fr: Rejeter

source: Status
fr: Statut

source: Authenticator
fr: Authentifieur

source: Local key for response
fr: Clé locale pour la réponse

source: Key of container {short_cryptainer_uid}
fr: Clé du conteneur {short_cryptainer_uid}

source: Concerned authenticator key
fr: Clé d'authentifieur concernée

source: Cryptainer metadata
fr: Metadata du cryptainer

source: Decryption status
fr: Statut de déchiffrement

source: Close
fr: Fermer

source: Symkey decryption request
fr: Requêtes de déchiffrement de la Symkey

source: This will allow unmasking the requested Symkey parts
fr: Cela permettra de révéler les morceaux de Symkey requis

source: Enter your authenticator passphrase
fr: Entrez votre phrase secrète d'authentifieur

source: Do you want to reject this request?
fr: Voulez-vous rejeter cette requête ?

source: Loading of authenticator private key failed (wrong passphrase?)
fr: Le chargement de la clé privée d'authentifieur a échoué (mauvaise phrase secrète ?)

source: The decryption request was accepted
fr: La demande de déchiffrement a été acceptée

source: The authorization request was rejected
fr: La demande d'autorisation a été rejetée

source: Authorization requests
fr: Demandes d'autorisation

source: Pending
fr: En cours

source: Accepted
fr: Accepté

source: Rejected
fr: Rejeté

source: Symkey decryption requests: %d
fr: Requêtes de déchiffrement de symkey : %d

source: Authorization requests were updated
fr: Requêtes d'autorisation mises à jour

source: Authenticator does not exist in remote registry
fr: L'authentifieur n'existe pas dans le registre distant

source: The keystore secret of authenticator is not valid
fr: Le secret de keystpre de l'authentifieur n'est pas valide

source: Error querying gateway server, please check its url and your connectivity
fr: Erreur lors de l'appel au serveur gateway, veuillez vérifier son url et votre connectivité

source: This page summarizes the authorization requests that have been sent to the selected authenticator, by people wishing to decrypt some of their containers.
fr: Cette page résume les demandes d'autorisation qui ont été envoyées à l'authentifieur sélectionné, par des personnes souhaitant déchiffrer certains de leurs conteneurs.

source: These requests can be freely rejected. Else, to accept them, you must input your passphrase, which will be used to load your private keys and generate authorization tokens for the requester.
fr: Les demandes peuvent être librement rejetées. Sinon, pour les accepter, vous devez saisir votre phrase secrète, qui sera utilisée pour charger vos clés privées et générer des jetons d'autorisation pour le demandeur.

source: For now, it is not possible to change the status of a request which has been accepted or rejected.
fr: Pour l'instant, il n'est pas possible de modifier le statut d'une demande qui a été acceptée ou rejetée.

source: Authorization requests page
fr: Page de demandes d'autorisation

source: Submit authorization request
fr: Envoyer la demande d'autorisation

source: Back to home
fr: Retour

source: Send an authorization request to remote key guardian
fr: Envoyer une demande d'autorisation au gardien de clés distant

source: Summary:
fr: Résumé :

source: Select key guardian(s) to query
fr: Sélectionnez les gardiens de clé à solliciter

source: Justify the authorization request
fr: Entrez le motif de la demande de déchiffrement

source: Enter a description (minimum 10 characters):
fr: Entrez une description (minimum 10 caractères) :

source: Send my decryption request
fr: Envoyer la requête de déchiffrement

source: Container(s) selected
fr: Conteneur(s) sélectionné(s)

source: Gateway url
fr: Url de la passerelle

source: Authenticator %s does not exist in sql storage
fr: Authentifieur %s non existant dans le stockage sql

source: Public key needed does not exist in key storage in %s authenticator
fr: La clé publique requise n'existe pas dans le stockage des clés de l'authentificateur %s.

source: Please select authenticators
fr: Veuillez sélectionner un authentifieur

source: Description must be at least %s characters long.
fr: La description doit faire au moins %s caractères de long.

source: Successful requests: {successful_request_count} out of {len_authenticator_selected}
fr: Demandes réussies: {successful_request_count} sur {len_authenticator_selected}

source: Error Report
fr: Rapport d'erreurs

source: Operation Report
fr: Rapport d'Opération

source: Container: %s
fr: Conteneurs: %s

source: Authenticator key
fr: Clé de l'authentifieur

source: Symkey decryption status
fr: Statut de déchiffrement de la Symkey

source: Authorization request summary
fr: Résumé de la demande d'autorisation

source: All authorization requests
fr: Toutes les demandes d'autorisation

source: View authorization requests submitted for each container
fr: Voir les demandes d'autorisation soumises pour chaque conteneur

source: Network error, please check the gateway url
fr: Erreur de réseau, veuillez vérifier l'url de la passerelle

source: Authorization requests: %d
fr: Demandes d'autorisation: %d

source: Refreshed authorization requests
fr: Demandes d'autorisation rafraichies

source: Enter the passphrase for one of the key guardians
fr: Entrez la phrase secrète pour l'un des gardiens de clés

source: Prepare decryption
fr: Préparer le déchiffrement

source: Containers selected for decryption
fr: Conteneurs sélectionnés pour déchiffrement

source: Summary of related key guardians
fr: Résumé des gardiens de clé concernés

source: Add a passphrase
fr: Ajouter une phrase secrète

source: Attempt decryption
fr: Tenter le déchiffrement

source: Request remote authorization
fr: Demander l'autorisation à distance

source: Last decryption report
fr: Dernier rapport de déchiffrement

source: Refreshed concerned containers
fr: Liste des conteneurs concernés rafraichie

source: not found
fr: non trouvé

source: not set
fr: non renseigné(e)

source: found
fr: trouvé

source: set
fr: renseigné(e)

source: Key guardian
fr: Gardien de clés

source: passphrase
fr: phrase secrète

source: None
fr: Aucun(e)

source: Private key(s) missing locally
fr: Clé(s) privée(s) manquant localement

source: Private keys needed for decryption are present
fr: Les clés privées nécessaires au déchiffrement sont présentes

source: Private keys needed were not found
fr: Les clés privées nécessaires sont introuvables

source: Keypair n°
fr: Paire n°

source: Keypairs used
fr: Paires de clés utilisées

source: Already existing passphrase
fr: Phrase secrète déjà existante

source: Passphrase doesn't match any relevant private key
fr: La phrase secrète ne correspond à aucune clé privée pertinente

source: Passphrase recognized
fr: Phrase secrète reconnue

source: Validation result: %s
fr: Résultat de validation : %s

source: Add passphrase
fr: Ajouter une phrase secrète

source: All decryptions failed, see reports
fr: Tous les déchiffrements ont échoué, voir les rapports

source: Decryption report
fr: Rapport de déchiffrement

source: Export folder: %s
fr: Dossier d'export : %s

source: SUCCESS
fr: SUCCÈS

source: FAILURE
fr: ÉCHEC

source: {decrypted_container} out of {selected_container} container(s) have been decrypted
fr: {decrypted_container} sur {selected_container} conteneur(s) ont été déchiffrés

source: Decryption status for {cryptainer_name}: {decryption_status}
fr: Statut du déchiffrement de {cryptainer_name} : {decryption_status}

source: No errors/warnings when decrypting the container
fr: Aucune erreur/avertissement lors du déchiffrement du conteneur

source: Containers
fr: Conteneurs

source: Select all
fr: Sélectionner tout

source: Select none
fr: Sélectionner rien

source: View and manage encrypted containers
fr: Voir et gérer les conteneurs chiffrés

source: selected: %d
fr: Sélectionné: %d

source: Delete
fr: Supprimer

source: missing
fr: manquant

source: Refreshed local containers
fr: Conteneurs locaux rafraichis

source: Container ID
fr: ID de conteneur

source: Key Guardians used
fr: Gardiens de Clés utilisés

source: Unknown
fr: Inconnu(e)

source: Please select containers to delete
fr: Veuillez sélectionner les conteneurs à supprimer

source: Are you sure you want to delete %s container(s)?
fr: Êtes-vous sûr de vouloir supprimer %s conteneur(s) ?

source: Container deletion confirmation
fr: Confirmation de suppression de conteneur

source: Confirm deletion
fr: Confirmer suppression

source: Please select containers to decrypt
fr: Veuillez sélectionner les conteneurs à déchiffrer

source: Enter the ID of the authenticator:
fr: Entrez l'ID de l'authentifieur :

source: Authenticator ID
fr: ID d'authentifieur

source: Do you want to import the private keys (passphrase-protected) as well?
fr: Voulez-vous aussi importer les clés privées (protégées par phrase secrète) ?

source: Key Guardians
fr: Gardiens des Clés

source: Please select the key guardians used to secure recordings
fr: Veuillez sélectionner les gardiens de clés utilisés pour sécuriser les enregistrements

source: Import from USB
fr: Importer depuis USB

source: Import from Web
fr: Importer depuis Web

source: No connected authentication devices found
fr: Aucun périphérique d'authentification trouvé

source: No initialized authentication devices found
fr: Aucun périphérique d'authentification initialisé trouvé

source: {foreign_keystore_count} new authenticators imported, {already_existing_keystore_count} updated, {corrupted_keystore_count} skipped because corrupted
fr: {foreign_keystore_count} nouveaux authentifieurs importés avec succès, {already_existing_keystore_count} mis à jour, {corrupted_keystore_count} ignoré(s) car corrompu(s)

source: Please select key guardians to remove
fr: Veuillez sélectionner les gardiens de clé à supprimer

source: Are you sure you want to remove %s key guardian(s)?
fr: Êtes-vous sûr de vouloir supprimer %s gardien(s) de clé

source: Key guardian removal confirmation
fr: Confirmation de suppression de gardiens de clé

source: Confirm removal
fr: Confirmer suppression

source: Refreshed imported key guardians
fr: Les gardiens de clé importés ont été rafraîchis

source: Key n°
fr: Clé n°

source: Key Guardian %s
fr: Gardien de Clés %s

source: Import keys from web gateway
fr: Import de clés depuis la passerelle web

source: Import keys from USB drives
fr: Import de clés depuis les stockages USB

source: Yes
fr: Oui

source: No
fr: Non

source: Badly formed hexadecimal UUID string
fr: Chaîne UUID hexadécimale mal formée

source: Authenticator does not exist
fr: Authentifieur non existant

source: Authenticator has been imported successfully
fr: L'authentifieur a été importé avec succès

source: Import result: %s
fr: Résultat de l'import : %s

source: Recorder
fr: Enregistreur

source: Reset background service
fr: Réinitialiser le service en fond

source: Start Recording
fr: Lancer Enregistrement

source: Stop Recording
fr: Arrêter Enregistrement

source: Ffmpeg module not found, please ensure it is in your PATH
fr: Module ffmpeg non trouvé, veuillez vérifier qu'il est dans votre PATH

source: Ffmpeg module is installed, but beware its version couldn't be determined
fr: Module ffmpeg installé, mais attention sa version n'a pas pu être déterminée

source: (private key present)
fr: (clé privée présente)

source: (missing private key)
fr: (clé privée manquante)

source: (private key not present)
fr: (clé privée non présente)

source: Request "{revelation_request_description_truncated}" ({reformatted_revelation_request_creation_date})
fr: Demande "{revelation_request_description_truncated}" ({reformatted_revelation_request_creation_date})

source: for {keystore_owner}
fr: pour {keystore_owner}

source: at
fr: à

source: Abnormal error caught: %s
fr: Erreur anormale détectée : %s
